
## BGP. Основы.

#### Цель:
Настроить BGP между автономными системами
Организовать доступность между офисами Москва и С.-Петербург

1. Настроить eBGP между офисом Москва и двумя провайдерами - Киторн и Ламас.
2. Настроить eBGP между провайдерами Киторн и Ламас.
3. Настроить eBGP между Ламас и Триада.
4. Настроить eBGP между офисом С.-Петербург и провайдером Триада.
5. Организовать IP доступность между пограничным роутерами офисами Москва и С.-Петербург.

##  Схема стенда 

![](eigrp.png)

#### Выполнение.

* Нам важна следующая информация:
1. Номер AS Москва и блок IP-адресов. Их мы уже получили: AS1001 и блок: 140.100.100.0/24.
2. Номер AS С.-Петербург и блок IP-адресов. Их мы уже получили: AS2042 и блок: 20.0.0.0/24.
3. Номер AS провайдера «Киторн» и линковая подсеть с ним. AS101 и линковая сеть: 101.0.0.0/30.
4. Номер AS провайдера «Ламас» и линковая подсеть с ним. AS301 и линковая сеть: 30.1.0.0/30.
5. Номер AS провайдера «Триада» и линковая подсеть с ним. AS520 и линковая сеть: 52.1.0.0/30, 52.1.0.4/30.

#### Настройка офис Москва:


* R14:

```
R14#sh run | s r b
router bgp 1001
 bgp log-neighbor-changes
 network 140.100.100.0 mask 255.255.255.0
 neighbor 101.0.0.1 remote-as 101
R14#

R14#sh ip bgp 
     Network          Next Hop            Metric LocPrf Weight Path
 *>   20.0.0.0/24      101.0.0.1                              0 101 301 520 2042 i
 *>   30.1.0.0/22      101.0.0.1                              0 101 301 i
 *>   52.1.0.0/20      101.0.0.1                              0 101 301 520 i
 *>   101.0.0.0/21     101.0.0.1                0             0 101 i
 *>   140.100.100.0/24 0.0.0.0                  0         32768 i
R14#
```

* R15:

```
R15#sh run | s r b
router bgp 1001
 bgp log-neighbor-changes
 network 140.100.100.0 mask 255.255.255.0
 neighbor 30.1.0.1 remote-as 301
R15#

R15#sh ip bgp 
     Network          Next Hop            Metric LocPrf Weight Path
 *>  20.0.0.0/24      30.1.0.1                               0 301 520 2042 i
 *>  30.1.0.0/22      30.1.0.1                 0             0 301 i
 *>  52.1.0.0/20      30.1.0.1                               0 301 520 i
 *>  101.0.0.0/21     30.1.0.1                               0 301 101 i
 *>  140.100.100.0/24 0.0.0.0                  0         32768 i
R15#
```

R14 получает маршруты через стык между Киторн (AS101) и Ламас (AS301), так как сессия между Киторн (AS101) и Триада (AS520) не поднята, по условию.

#### Настройка офис Санкт-Петербург:

* R18:

```
R18#sh run | s r b 
router bgp 2042
 bgp log-neighbor-changes
 network 20.0.0.0 mask 255.255.255.0
 neighbor 52.1.0.1 remote-as 520
R18#

R18#sh ip bgp 
     Network          Next Hop            Metric LocPrf Weight Path
 *>   20.0.0.0/24      0.0.0.0                  0         32768 i
 *>   30.1.0.0/22      52.1.0.1                               0 520 301 i
 *>   52.1.0.0/20      52.1.0.1                 0             0 520 i
 *>   101.0.0.0/21     52.1.0.1                               0 520 301 101 i
 *>   140.100.100.0/24 52.1.0.1                               0 520 301 1001 i
R18#
```

Таким образом, у нас Full View на граничных маршрутизаторах.

#### Настройка провайдера Киторн:

```
R22#sh run | s r b
router bgp 101
 bgp log-neighbor-changes
 network 101.0.0.0 mask 255.255.248.0
 neighbor 101.0.0.2 remote-as 1001
 neighbor 101.0.0.6 remote-as 301
R22#

R22#sh ip bgp 
     Network          Next Hop            Metric LocPrf Weight Path
 *>   20.0.0.0/24      101.0.0.6                              0 301 520 2042 i
 *>   30.1.0.0/22      101.0.0.6                0             0 301 i
 *>   52.1.0.0/20      101.0.0.6                              0 301 520 i
 *>   101.0.0.0/21     0.0.0.0                  0         32768 i
 *    140.100.100.0/24 101.0.0.6                              0 301 1001 i
 *>                    101.0.0.2                0             0 1001 i
R22#
```

#### Настройка провайдера Ламас:

```
R21#sh run | s r b
router bgp 301
 bgp log-neighbor-changes
 network 30.1.0.0 mask 255.255.252.0
 neighbor 30.1.0.2 remote-as 1001
 neighbor 52.1.0.9 remote-as 520
 neighbor 101.0.0.5 remote-as 101
R21#

R21#sh ip bgp 
     Network          Next Hop            Metric LocPrf Weight Path
 *>   20.0.0.0/24      52.1.0.9                               0 520 2042 i
 *>   30.1.0.0/22      0.0.0.0                  0         32768 i
 *>   52.1.0.0/20      52.1.0.9                 0             0 520 i
 *>   101.0.0.0/21     101.0.0.5                0             0 101 i
 *>   140.100.100.0/24 30.1.0.2                 0             0 1001 i
 *                     101.0.0.5                              0 101 1001 i
R21#
```

#### Настройка провайдера Триада:

```
R24#sh run | s r b
router bgp 520
 bgp log-neighbor-changes
 network 52.1.0.0 mask 255.255.240.0
 neighbor 52.1.0.2 remote-as 2042
 neighbor 52.1.0.10 remote-as 301
R24#

R24#sh ip bgp
     Network          Next Hop            Metric LocPrf Weight Path
 *>   20.0.0.0/24      52.1.0.2                 0             0 2042 i
 *>   30.1.0.0/22      52.1.0.10                0             0 301 i
 *>   52.1.0.0/20      0.0.0.0                  0         32768 i
 *>   101.0.0.0/21     52.1.0.10                              0 301 101 i
 *>   140.100.100.0/24 52.1.0.10                              0 301 1001 i
R24#
```

#### Проверка доступности (ping) между Москвой и Питером

